{
    "Post ID": "131g8xx",
    "Post Title": "Pittsburgh Zoo welcomes two leopard cubs",
    "Post Body": "",
    "Post Score": 107,
    "Post Upvote Ratio": 0.94,
    "Post Permalink": "/r/UpliftingNews/comments/131g8xx/pittsburgh_zoo_welcomes_two_leopard_cubs/",
    "Post Number Of Comments": 11,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*I thougt we were always told theyll never prosper. Wait no thats cheetahs.These beautiful animals should live in the wild, not locked up to entertain us.The same way jail 'welcomes' youComing with attitude. Such beautiful creatures !They are cute.\n\nIs it rare for leopards to have twins?That is not what zoos are anymore. Try educating yourself about the conservation and habitat restoration programs of zoos worldwide.Yes, please ignore the scientific research and species conservation activities of zoosThis is beyond annoying these comments. Do you have any idea what zoos do? They are not just for entertainment. These type of leopards are critically endangered and many zoos are actively involved in conversation programs of many species.That is another excuse to lock up animals in the name of science and avoiding what really needs to be done. Besides I think it is you who needs some education. Since it is already proven and documented that these \" institutions\" under the  moniker of conservation breed animals to sell so they can fund these projects. Sure there are some with good intentions. But lets be clear, we are the problem.In other words you have absolutely no understanding of what zoos do.",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "131j703",
    "Post Title": "Historic Achievement: Remilk Becomes First Company to Secure Regulatory Approval For Non-Animal Milk Protein in Israel",
    "Post Body": "",
    "Post Score": 52,
    "Post Upvote Ratio": 0.93,
    "Post Permalink": "/r/UpliftingNews/comments/131j703/historic_achievement_remilk_becomes_first_company/",
    "Post Number Of Comments": 1,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "131ali7",
    "Post Title": "Partners Extend International Space Station for Benefit of Humanity",
    "Post Body": "",
    "Post Score": 155,
    "Post Upvote Ratio": 0.97,
    "Post Permalink": "/r/UpliftingNews/comments/131ali7/partners_extend_international_space_station_for/",
    "Post Number Of Comments": 5,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*> The United States, Japan, Canada, and the participating countries of ESA (European Space Agency) have confirmed they will support continued space station operations through 2030 and Russia has confirmed it will support continued station operations through 2028.This is old news.Humanity's future is an ever-expanding team of Nations and companies enabling exploration together and for the benefit of all.The Russians just confirmed this. Everybody else has been onboard for a while.",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "1315n08",
    "Post Title": "Buddha statue found in Egypt points to ancient India links",
    "Post Body": "",
    "Post Score": 134,
    "Post Upvote Ratio": 0.93,
    "Post Permalink": "/r/UpliftingNews/comments/1315n08/buddha_statue_found_in_egypt_points_to_ancient/",
    "Post Number Of Comments": 7,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*Of course it does. Contact between the Indian subcontinent and the near east has been observed since the time of the Indus Valley. That trade and connection that had continued for thousands of years was significant in shaping world history itself, so finding Buddhist statues in Egypt shouldn't come as a big surprise. The Harappans had trade relations with their contemporaneous Mesopotamians, the Romans whined about how much gold was shipped off to India for the cotton, Alexander had to face mutiny because of his troops' unwillingness to face one of the kingdoms of the subcontinent....A Buddha in Egypt? Beddha believe it![deleted]I'm willing to bet the system of Old World contacts between cultures are far more widespread than we realizeIn the past years, there are many buddha statue reappearing, for example the buddha statue in china, that reappeared due to the sinking water levelsthanks",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "130yigd",
    "Post Title": "New treatment significantly improves chances of babies with acute leukemia",
    "Post Body": "",
    "Post Score": 183,
    "Post Upvote Ratio": 0.96,
    "Post Permalink": "/r/UpliftingNews/comments/130yigd/new_treatment_significantly_improves_chances_of/",
    "Post Number Of Comments": 10,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*Chances of survival for*A big W for leukemia fans'survival for' vs. 'producing'I feel like this could've been phrased better.The treatment is sex.I don’t think we want more of them.I am guessing this is a translation error, but oof, the headline of this piece. Still great news, though. The actual news, anyway. Not the headline.Yeah that headline definitely makes it sound like the opposite",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "12zhjb8",
    "Post Title": "Kansas City considers becoming a transgender ‘safe haven’ in defiance of Missouri laws",
    "Post Body": "",
    "Post Score": 23029,
    "Post Upvote Ratio": 0.86,
    "Post Permalink": "/r/UpliftingNews/comments/12zhjb8/kansas_city_considers_becoming_a_transgender_safe/",
    "Post Number Of Comments": 159,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*Missouri lawmakers: \"We won't be dictated to! We want local autonomy!\"\n\nKansas City: \"We'll get right to work on it.\"\n\nMissouri lawmakers: \"No, not like that!\"[removed]And what will happen is the state legislature will start doing things like deny bond money and services to any local government that does not enforce state law, with it ending with the state stripping the city of home rule.What's does \"considers becoming a transgender safe haven\" even mean? Is anything concrete actually happening?How does this work since Kansas city is split among 2 states? Like, would they be in any danger if they went to the Kansas side?Carry on my wayward them/her/hisGood, people need safe spaces in that trainwreck of a countryNew slogan: Come for the BBQ, stay for the surgery.[removed]Hell yeahGood.Most metro areas should be. It's the rural areas / small towns that are more bigoted. Unfortunately our democratic system is broken in the USA. This gives sparsely populated rural and suburban places same weightage as denser metros. The rural and suburban population is much more susceptible to manipulation by right wing politicians.I low-key love seeing this kind of thing.\n\nSticking it to the man while protecting trans-folk is a win-win in my books.They should name the legislation \"Anti-Sundown Act\" or something.  Tie it to historically shameful acts by state and local governments.Is the USA going to have its first city state? \n\nKansas City state.Every town, city, county, region, state, whatever the fuck, should make as many laws as they can protecting this stuff. Make it a genuine ordeal to undo it all. Make the public aware of what you're doing, and what Republicans will have to do to change it. Tansparency right now is a big weapon against intolerance. The majority of the public really just wants to go about their day, but most will stand up if they're faced directly with injustice. It's a complete misconception that most people are totally indifferent. They're only indifferent when it's not their reputation on the line. If the public is made accutely aware of their role in all this, it does make a difference. Many people just need a nudge in the right direction.I love thisThere is no true safe haven in a red state.amazing.Go ChiefsHere is my proposal.  Any city above a certain size, say the population of Idaho, automatically becomes it own separate state with two Senators.  Let the Fun and Games begin.[removed]Gathering a marginalized group in a fascist state? Think hard on this.Just curious, do any of you ever step outside of your little bubble where things like this mean something?And then they got Kansas to the west. Must be a horrible situation.What does this even mean lmfao[deleted][deleted]0 chance you should trust thisThey've been doing this to Austin in Texas for years nowMissouri hates local control so much they won't let KC control their police.\n\nFunding gets determine at a state level vote and the board is picked by the state. No other PD in the state is this way \n\nKCPD is awful and unaccountableKansas City: we actually need tourism thanks\n\n(check out their museum of miniatures, its really cool)That's exactly what the state government did when KC and St. Louis passed higher minimum wages a couple years ago.The \"small government\" GQP State Legislature here in Florida has been systematically destroying and usurping local governments' authority for decades. The State wants to dictate all.There are only two types of government recognized in the Constitution — federal and state. \n\nSo “local” representation can mean at the state level without being too hypocritical in a technical sense. Both sides love/hate sanctuary policies (immigration, gun rights, abortion, whatever) when it’s convenient.[removed]Like marginalizing gun owners?  I agree.Considering they've made it impossible to access gender-affirming care, I'm going to assume it's providing gender-affirming care, not allowing for \"anti-drag\" laws that target transgender people, and not prosecuting state law violations or collaborating with state law enforcement. Similar to the immigrant safe haven laws of 2017/2018 not cooperating with ICE on immigration raids in their cities.KCMO and KCK are two different cities, so they operate independently. There's definitely collaboration, and residents frequent each one equally, but legally they are separate.\n\nThere's a common joke where, if you live in MO and you'd like to bet on sports, you have to drive over state line to do so. Equally, if you live in KS and you'd like to buy marijuana, you have to drive over state line to do so.They could be. There is KCMO (Missouri side) & KCK (Kansas side). Each has their own separate government and laws. \n\nBut all the money on the KS side is really in Johnson County which isn’t KCK it’s Overland Park & Olathe & Mission & a bunch of other small suburbs/towns we just call Johnson County. So they could all have their own legislation as well. \n\nNot sure what the KS side is doing yet but they may end up aligning with KCMO since Johnson County & KCK is pretty progressive it’s really the rest of KS (excluding Lawrence/KU) that are reactionary conservatives.As others have said, they are 2 wholey different cities, Kansas City, Missouri was founded in 1850 as the town of Kansas, 11 years before Kasaka even became a state. \n\nKansas City, Kansas was founded in 1880 by the Governor of Kansas by merging 5 towns to try and trick people that they ere still in Kansas City, Missouri, and to spend money there.Should be wayward child. The original song isn't \"my wayward him\"...I think that's Kansas the state, not Kansas City.🎵 There'll be peace if you're not cis 🎵[deleted]Newsflash, America is NOT (and never was) a Christian nation. The founding fathers were quite explicit on that point.\n\nNevermind how a lot of so-called \"christians\" nowadays are anything but.A lot of people misinterpreting what this person is saying. They're not saying KC is harboring Nazis, they're saying Missouri is because of the anti trans lawsMissouri ~~considers becoming~~ **is already** a Nazi safe haven in defiance of the teachings of Jesus.You knowwwww… Jesus was *most likely a Trans man, if the bible is correct.* If it was an immaculate conception, he would not have inherited a y chromosome from anybody, and yet he presented as traditionally masc and used he/him pronouns. And eve was created with XY DNA from adam’s rib, and yet she was formed into a woman. God has been transing people’s genders from day one and I don’t think he would like all this shit you’re talking about his divine creations.Found someone who uses Christianity as a tool for oppressionI don't know, I mean, I checked and it doesn't say that Jesus said \"Don't become a Nazi safe haven\".\n\nI mean you still should not do that, don't get me wrong. But that's dictated by common logic and not being a bunch of right-wing assholes and nazis, not by the supposed ramblings of some random guy in an old historic fantasy novel.[removed][removed]Oh, yeah, I'm sure the people who think kids shouldn't be transitioning at age five are just raring to go out and murder. Because why else would you possibly be against that unless you're a bloodthirsty killer?It means you didn't read the article before commenting.You are right, better to do nothing /sDon't give shit to people for tryingEh, I was born and raised in KC and I feel fairly progressive, caring, and logical.\n\nMissouri is still Missouri, but there are still quite a few people (especially in the city) that aren't \"crazy rednecks,\" and are more like-minded.\n\nHowever, drive 20min. in either direction from KC and you'll be SURROUNDED by the former.??? Kansas City is a large city with a diverse population. Leans blue like most cities. Not likely you would have grown up a redneck if you had been raised there.Holy false dichotomy batmanIn every sense, Austin is a safe haven from the rest of Texas.Same to Houston\"Stay weird\" turning to \"stay in line\"The Pot Amendment gave the State government minimal control over it, think where shops can be and the taxes on it. They have been trying to undermine it since it passed.Dont forget the WW1 museum and the Nelson Atkins.We don't even have local control of police in KC, why should we have any autonomy at all? /s\n\nThe last election also forced KC to increase police funding by 25%. That vote was statewide for some reason.Every single thing the GOP accuses anyone of doing is an admission and the things they strive for are limited to them and them alone. \n\n* Small government, unless local governments do things they dislike\n\n* Freedom of speech, unless you criticize them. \n\n* Protect the children, unless it's from guns\n\n* The free market, unless they speak out against your laws.\n\n* Freedom of religion, unless it's not Christian.\n\n* Bodily autonomy, unless it's a woman.\n\n* Cancel culture is bad, unless it's bud light or Disney or M&Ms or Nike\n* Government spending is bad, unless it's tax cuts for the wealthyOh, I know. My joke wasn't supposed to be a serious commentary on Constitutional  government.Found the FrenchmanJesus, we are really at the point where treating other people like they're people is considered progressive enough to be on the news. Standing up to injustice too. As if one needs a reason to stand up to tyrants.Don't forget abortions on the KS side lolThe band, Kansas, has yet to offer an opinion.Kansas is passing their own shitty anti-lgbt laws and also has its own Kansas City. It's one connected metro area but I think the two sides are individual incorporated cities. They can both tell their respective state legislatures to pound sand.The state was named after the city.State of denial?\n\nFor reals though. I'm looking for a better place.CountryThe comment you're replying to is saying that American Christian Fascists are defying the teachings of their own religion, and the values they supposedly support.\n\nThe US not being a Christian theocracy is irrelevant, because they are talking specifically about the group trying to make it one.The US Constitution is a divinely-inspired document.Yeah, I mis-read that about 5 times lol.Missouri is not a Nazi safe haven. KC and St. Louis push the state way too purple for Nazis to consider living here.This is some fucking real delusion.You completely missed my point. Let me try again: Nazism is in defiance of Jesus' teachings.\n\nDo you disagree with that?Reread it, he's accusing Missouri of being Nazis for their anti-transgender laws. It slipped me up at first too.No because conservative Christians ignore the teachings like \"Love One Another\" and \"Let Them Who Is Without Sin Cast The First Stone\" which are the teachings of Jesus. \n\nThat's why I used the words \"teachings of Jesus\" and not Christianity.[removed]Wtf are you talking about. I'm saying don't trust the government on this.Safe spaces aren't realI fully believe it's not even part of Texas.It varies from City to City, but a lot of the major cities in Texas are like that.Coastal cities just hit different in TxThey've been trying for years. Austin isn't what it was don't get me wrong, but as a collective Austin is still super liberalAnd burnt ends, can’t forget the burnt ends when you’re in KCAnd the GOP says they're not fascist... I guess my vote doesn't matter jack shit because some dumbfuck in the boonies wants the state government to control the funding to my police force.I brought up the fact that the bud light thing is cancel culture and ooooh boy the people who were so pissed at that! Some told me that canceling can't be done to companies, it's just boycotting while canceling can only be done to individuals...others told me I shouldn't have kids. Lots told me I should move out of CA but didn't respond when I told them I've never lived anywhere other than the east coast haha.> Protect the children, unless it's from guns\n\nOr clergy. \n\nOr Republican lawmakers.\n\n Or abusive religious households who force them to marry their rapist at 14...If they cut taxes, the government has less to spendYes, Kansas City Missouri and Kansas City Kansas are separate municipalities.  For even more fun there's also North Kansas City, which is also its own thing, but is different than Kansas City north.Which was named after the riverThe great state of Denial is a safe space for everyone :)It's as divinely inspired as the King James bible was.\n\nas in, not at all.As someone who lives here, I wholeheartedly disagree.I grew up just outside of KC and I know of at least 1 bar within 10 minutes of downtown KC where they have a \"No Hablo Fucktardo\" sign hanging proudly above the bar and ALL rap/hip-hop is blocked on their jukebox lol place wasn't like that a handful of years ago, a lot of stuff has regressed over the past 4 or 5 years. Everything is segregated out here one way or another. Hell, I got \"yall aren't from around here are ya\" at a bar across the street from the house I grew up in, it's wild how different even small areas can be depending on which part you go to.I mean, where did he get the Y chromosome then?Trans people aren’t Nazis so your hypothetical actually doesn’t pan out??Ahh I see, I think they're closer to fascists than Nazis.Although the Nazis do hate communism as much as conservatives.Wait can you rephrase your original point? Most people reading your comment are interpreting it as you saying Trans people are the Nazis, but it seems like you’re trying to say something different - it might be worth an explanatory edit[removed]You're implying it's a bad idea to have trans people grouped together because it makes it easier to, like, get rid of them. Completely ridiculous. As if step one is a sanctuary city, step two is OPERATION: TRANS DESTRUCTION.What does this even mean lmfaoKansas City also feels like it’s not part of MO when you venture to the boonies.\n\nEdit: Also half of it is technically not MO anyway, it’s Kansas (which is objectively the worse of the two sides, jk I love you, Kansas).A lot of the major cities in general are like that, especially when nestled in red territoryMajor cities in Texas are like major cities everywhere else.They're built differentTell them you live in rural Tennessee.Which was named after the bandIt was named after the Kaw (Kansa) people who were there first. It's the Missouri river that cuts through Kansas City and the state line.\"[In God We Trust.](https://en.wikipedia.org/wiki/In_God_We_Trust)\"\n\n\"[I pledge](https://en.wikipedia.org/wiki/Pledge_of_Allegiance) allegiance to the Flag of the United States of America, and to the Republic for which it stands, one nation **under God**, indivisible, with liberty and justice for all.\"\n\n&#x200B;\n\nUSA wasn't, but now is a Christian-nationalist state. It started during when [the parties switched with Southern Strategy](https://en.wikipedia.org/wiki/Southern_strategy); when the Republican party started to embrace fascist ideology. (Note: American fascism has been around since forever (eg, black slavery, native genocide), but we're talking about a particular paradigm of American fascism.)\n\n&#x200B;\n\nEdit: oo, it seems I upset the far-right. In Allah we Trust? One Nation under Shiva?I also live here. It isn't nearly as bad as you're making it out to be. If we get our blue population to have a somewhat higher turnout next election, we should be fine. Furthermore, I suspect there is some voting shenanigans going on, as I have not met a singular person in the rural, red area that I live in who likes Josh Hawley.They don't like rap music? Those racists 😱From God? The story involves a deity spontaneously causing a pregnancy.He isn't a real person. He's a fictional character.Wtf does their reply mean did they read yours lol??? You were def not disagreeing that Missouri is turning into nazi country lmaoNazis are fascists tho.Except bigger with more freedom and less protections during a power outage in cold weatherWhich was named after a mispronunciation of ArkansasAnd this is what's called moving the goalposts. Your example of the Constitution being a divinely inspired document are two examples from the 1950s?\n\n>(Note: American fascism has been around since forever (eg, black slavery, native genocide),\n\nThat's not what fascism is. You don't need fascism to engage in genocide and slavery.I feel like those of us that are WASP passing but hard lefties should start registering as R and running in the primaries, then only talk economic policy. Cause honestly the people in rural areas are more or less on board with the left economically as long as you don’t use the word socialism or have a D next to their name. \n\nReverse southern strategy.>If we get our blue population to have a somewhat higher turnout next election, we should be fine\n\nI agree, and I'm all for this. Would LOVE to see Kunce win.Liking Hawley and voting for him are not the sameNo one likes Ted Cruz and yet he keeps getting reelected>If we get our blue population to have a somewhat higher turnout next election, we should be fine. \n\n>Furthermore, I suspect there is some voting shenanigans going on\n\nThese two concepts contrast each other quite a bit. I don't know how you think voting will help while simultaneously acknowledging that it's rigged.Yeah because that's all I said was off about the place lol if you had a different experience of KC then that's cool, I'm not trying to say your experience isn't valid, but for as 'progressive' as KC comes off (up until the past couple years anyway) it's wild to me that a place like that exists so close to the city. It wasn't always like that either, it just changed a couple of years ago so this isn't me just walking into a place for the first time and making a bunch of rash judgements. This used to be my go-to place but I moved away so it was no longer 'the bar down the street' for me but my partner and I have made a few visits the past couple months for nostalgia and it's a noticeably different vibe. Sorry if I came off like I'm calling it a racist/Nazi bar or w/e, I'm not trying to do all that. I just wanted to point out that we have long-standing, established businesses out here making RECENT changes to narrow the range of clientele that walks through their door in a very specific way and it's not a particularly rare thing, even close to the city. Even the bar down the street from me, IN KANSAS CITY, had a \"no sagging/loose fitting clothes\" sign on the front door until the owner died last year, too. It's pretty weird for a dive bar (or any bar/restaraunt in this area tbh) to have a dress code at all, but that one seemed pretty specific. And dated.All Nazis are fascists but not all fascists are Nazis. It's like squares and rectangles.Texas has 2 of the top 5 largest Metros in the US\n\nDuring the Winter Storm of 2022, Texas was one of the least affected states in terms of power outages.\n\nWe had a grid collapse, yes, and that is fucking terrible, but it is not the norm here, and to act like it is, well that's being purposefully obtuse. I live in one of the smaller metros, doing my work to make this state a better place. I have lost power 1 time in the last year. And it was a localized outage. Someone ran into a power pole. Yes, Austin had outages in the ice storm this year. That was a city ran municipal provider \"Last Mile\" issue. It's no one's fault but Austin for that. Dallas, who got hit just as bad, had almost no customers without power.It's \"our Kansas\" they said and the map guy wrote it down. It's true, i was there.Which is pronounced differently because back when they were both Territories their residents hated each other.>And this is what's called moving the goalposts.\n\nI'm sorry, but what is being moved?\n\nOff the top of my head, I don't recall any religious wording in the constitution and all of its amendments, but that doesn't change that USA morphed into a Christian-nationalist state, as observed by writings-on-the-wall elsewhere.\n\n&#x200B;\n\n>You don't need fascism to engage in genocide and slavery.\n\nIf we consider all the slaves and native americans as USA citizens, USA sure looks fascist.\n\nGranted, fascism is a relatively new word that didn't exist back then.Hell, just don't talk about socialism and gun control, and you have about 70% of rural voters ready to vote anyone in so long as it say Republican on the ballot.Because it isn't feasible to have voting tamerping past a certain magnitude in the US. Far easier to tamper votes of 51/49 than it is for 53/47 or more.\n\n If you have to tamper with hundreds of thousands of votes in a state election, someone is more likely to notice than 100k or lessSaid it better than I would haveI'm aware but in this case we're talking about people who act like fascists but are also really obsessed with the gender, religion and skin color of others. They like guns and military and think they are superior to the other groups (like trans people, non white people, nom Christian people). Also it often looks like they have no issue defending violence against said groups. Sounds a bit like Nazis to me but eh who am I to judge.In America they are.What are you on? You had [4.1 million people](https://thetexan.news/4-1-million-texans-without-power-for-second-day-ercot-provides-few-answers/) without power for two days. You could see the black out from [space](https://www.kxan.com/weather/weather-blog/before-and-after-satellite-captures-texas-power-outage-from-space/)Dems need to drop gun control all together, it’s a losing issue, and with all the Nazi stuff going on is alienating the left as well. You could even quote Marx and have it go over well.\n\n>\tUnder no pretext should arms and ammunition be surrendered; any attempt to disarm the workers must be frustrated, by force if necessary\n\nUltimately the trick would be winning your primary.Exactly cheating within the error bars is likely to go undetected. If suddenly Jackson County has a 90% voter turnout well… that’s obviously cheating.Please look at the year that article was posted and notice that I was not talking about the 2021 grid collapse. Which I did mention. With the 2022 and 2023 storms (December 2022, and Feb 2023) we were fine for the most part outside of some last mile issues.",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "130iugw",
    "Post Title": "Indian Government Aims to Turn 90 Airports Carbon-Neutral by 2024; Delhi, Mumbai and Cochin Airports Lead the Way | The Weather Channel",
    "Post Body": "",
    "Post Score": 144,
    "Post Upvote Ratio": 0.93,
    "Post Permalink": "/r/UpliftingNews/comments/130iugw/indian_government_aims_to_turn_90_airports/",
    "Post Number Of Comments": 6,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*Airports \n\nCarbon neutral\n\n???\n\n\n\nI wish them luck with that while the production of CO2 in the air transport industry is mainly produced by planes not airports and they won't ignore the fact that they are serving airplanesAre they going to shut them down ?Are we talking about the same India who recently boosted import of Russian oil and coal like never before?\n\nDon't make me laugh.Exactly what they'll achieve by 2024?They're doing their part. Making airports rely on green energy.",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "1304syk",
    "Post Title": "City of San Antonio is implementing ‘Cool Pavement’ Pilot Program",
    "Post Body": "The program will re-surface 10 existing road segments; the goal is to see which products are the best at reducing temperatures by absorbing less heat. This should improve quality-of-life for residents and help the City in its effort to combat climate change.",
    "Post Score": 476,
    "Post Upvote Ratio": 0.97,
    "Post Permalink": "/r/UpliftingNews/comments/1304syk/city_of_san_antonio_is_implementing_cool_pavement/",
    "Post Number Of Comments": 60,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*God we needed to be doing this shit 30 years agoAll the kids are into cool pavement.That's great!There is language in the IIJA authorizing the \"Healthy Streets Program\" which would provide $500 million for cool pavement, porous pavement, and tree planting projects to reduce urban heat islands. There is still no funding mechanism though. That program is crucial for encouraging more great projects like this.\"combat climate change\" you mean avoiding it's consequences?white paint....with lead problem solved !!!Anything to avoid building mass transit, huh San Antonio? You're a city now starting acting like one.My idea would be to put solar panels up over the roadway, Asphalt can't get hot if it's not exposed to the sun.  And think of all the extra juice CPS would have to help offset demand during peak AC use times.\n\nMight also reduce accidents in eastbound lanes at sunup and westbound lanes at sundown.Why build 10 pilot roads? Can’t they test 10 square meters in a parking lot somewhere and select the best one for all the roads?Reflecting the light is also a large contributor to heating, just not on the immediate surface.  The best approach is to limit paved surfaces where we can.The best solution is to remove roads make meandering bike paths and plant a lot of trees.Does this make the city less car-centric?https://www.shutterstock.com/image-photo/tree-lined-country-road-158613407\n\nTHIS around as many roads as physically possible!  Professionally pruned/treated to encourage tall umbrella shape growth over the road ways with minimal to zero growth over the outside edges so they won't interfere with buildings or powerlines!texas will do ANYTHING to not speak about the guns and waste money on cool streets instead of taking care of the residents. the average income is 26K. average home price is 262K.  then there's this:  \n\"The overall crime rate in San Antonio is 4,362 per 100k people, the San Antonio violent crime is 735 per 100k people (64.6% higher than the state and 89.5% higher than the County), and the property crime in San Antonio is 3,627 per 100k people (61.6% higher than the state and 85.2% higher than the country.) Mar 15, 2023.\"   \nbut, hey! we got cool streets here, folks!They’re streets ahead.An AT&T golden handshake saved me in 2K from relocating there from the cool low dewpoint Land of Sky Blue Waters.Just wait to see what we can do when people start to starve!It’s Texas, I’m surprised they’re doing it at all.Really? The Netherlands figured this out over 50 years ago. They are called treesWe didn’t because all that kind of stuff is for wimps, like electric cars, solar power and windmills and all that stuff. I bet you wipe your butt with toilet paper instead of something else like tree bark.  \n\n/sReflecting solar energy back into space isn’t like building higher seawalls. It does directly work against climate change itself.Might be due to it being cheaper or something.  They never figure out that cheap solutions cost more in the long run...Solar panels also cause urban heat island effect.  Their dark color absorbs energy and radiates heat in a similar fashion to asphalt.\n\nThis idea would cool the pavement, and help clean up the grid, it wouldn’t solve the issue at hand completelyThe problem there is it would have to be about 16ft off the ground (minimum power line height most places) at a minimum and significant structure would have to be built to do that.Probably because they will need to test the wear and tear of the new asphalt.They probably need to have a fairly large area of pavement in order to determine the effect on ambient temperature. Smaller areas probably wouldn't yield a large enough difference to tell if there's a significant difference at all.Because 10 square meters in a parking lot isn't equivalent to realistic and varied conditions.I believe Ontario does (did?) asphalt tests on a short stretch of the 417 highway between Ottawa and Montreal, right after you cross into Ontario. Not sure if they still do; I haven't used the 417 in a couple years. But there'd be strips of road that were all different and uh at one point they were damaged enough that it became a bumpy ride lol (months later they were doing road work to fix it and lawd the traffic). Think at some point they were also testing road paints, too.Ebikes FTWLOL.. remove the roads and most US cities would shut their doors.San Antonio is a blue city bruh... so maybe use some critical thinking skills about what you just said.Get some super-bread that works like that Lembas bread from Lord of the Rings.San Antonio is pretty blue. Wouldn't be surprised if Abbott somehow screws this up though.Trees are great, but Texas is not the Netherlands.  San Antonio is a dry climate, essentially savannah, with half the rainfall that you have in the Netherlands.  Trees  tend to be small and scrubby, except along rivers.>Reflecting solar energy back into space\n\nHigh albeado pavement isn't going to reflect anything into space... just because the pavement is cooler doesn't mean that radiation won't get reabsorbed before leaving the atmosphere.That's not how it works, they're not going to build roads out of mirrors... Its more about dissipation than reflection. And I bet the one that dissipate heat the best is also going to be the most polluting to make anyway. This is absolutely for comfort and has nothing to do with fighting climate change.It's more expensive. But that's where the money is. Public Transportation is the opposite, the money is on the other side.Mass transit is much cheaper than more roads, trees are also cheaper than resurfacing all the roads in the world. And they carbon capture and they help mental health. \n\nReally wonder about the logic behind thisNah trees beat all of those things.We already have it. It's called Huel.And what stops you from irrigation by waste water?Yes good point. However it is wrong to conclude from that fact that it does not mitigate global warming. \n\n>Radiation reflected into the top of the atmosphere alters the Earth’s radiative balance. This process, known as radiative forcing, can offset some of the radiation trapped by greenhouse gases, which can directly mitigate climate change.\n\nMore info here:\n\n\nhttps://cshub.mit.edu/sites/default/files/images/Albedo%201113_0.pdf I’m not sure about the San Antonio program specifically but in general one solution is to add reflective materials to the pavement to increase its albedo.  This will reflect light back into space. It also helps indirectly by lowering the temperature of the city so people can turn down their ACs. It is definitely one of the solutions we should be pursuing, especially since it is easily politically achievable.Depends on the type of mass transit... light rail is crap. It causes more traffic when poorly implemented as well... where it is built on the ground instead of on supports. Subways underground can be ok.https://youtu.be/sayw3TOhykg\n\nNot sure if this is the one or if im getting it mixed with another channel/video but, it has to do with how transit is funded in the US. Basically they don't get money unless they build roads (over simplification but general principle holds)Starvation has never sounded so appealingThat is practical for agriculture where treatment plants are nearby, and should be a expanded, but irrigation for street trees is not a good use of resources.  Landscaping needs to fit the climate.  Of course there are many approaches to minimizing climate change, but your arrogance that you know what those for a place you have never been and know nothing about  is palpable.No it does not. Man you cannot ignore the netherlands. Best roads in the world and best public transit in the world. You think they are connected somehow or is it just chance?Okay so stand up for what you believe in. Do you think the netherlands became what it is now because of the government?\n\nNo it took massive strikes before the rudder was turned aroundArrogance? I just asked a question. As far as I know there are also trees that live on savannah, and need very little maintenance. If I'm wrong please enlighten me, but attacking my character is not a good optionOf course its connected its tiny european country that has few to none of the problems that must be solved with transportation in the US...\n\nThat's a stupid as saying... why aren't US roads as good as Japan. you asked \"what is the logic behind this\" and i gave an answer. That wasn't a \"we can't change it because this is how it's done now\", i'm very much not a person who thinks that way. \n\nI for one am trying my best to stand up and fight back against the horrible system that is the US every single day.Oh what problems does the US have that we don't have?Being hundreds of miles between population centers.  Now, East coast is pretty tightly gathered, they could do mass transit well.  Central and western US?  Super spread out, mass transit outside of dense population centers becomes a huge budget drain.  And as a resident in the midwest, I so, SO wish that wasn't the case.  I would LOVE to be able to hop on a train to my Capitol and visit some shit they have there, but that's not an option.\n\nInstead, we drive two hours with the freedom to leave whenever we want and drive two hours back, or we take a bus that only comes to our town once every twelve hours, and be stuck there until the next bus.\n\nAnd if we did rail, it'd be all new line going to a place which would need a new station, and would need to have a train come in more frequently than the bus to be worth it to people, but it still wouldn't offer the same freedom of mobility and time departure a personal car offers.Why would you want public transit in the remote areas? Don't think you have problem there of too much asphalt heating up your little towns do you? \n\nNo I'm talking about densly populated areas obviously.Ah, my mistake, you're just here to be a snobbish ass to everyone.  Carry on.What? What do you mean?",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "12zpyvs",
    "Post Title": "Eric Adams Calls Off Unpopular N.Y.C. Library Budget Cuts",
    "Post Body": "",
    "Post Score": 785,
    "Post Upvote Ratio": 0.98,
    "Post Permalink": "/r/UpliftingNews/comments/12zpyvs/eric_adams_calls_off_unpopular_nyc_library_budget/",
    "Post Number Of Comments": 16,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*He has not called them all off. The library systems are still going to see a devastating $36 million in budget cuts. Only part of the cuts were rescinded.\n\nEdit: [source](https://twitter.com/C_Sommerfeldt/status/1651212432692375561?s=20)The budget of the NYPD is 5.7 billion dollars.  They could probably trim that by, oh I dunno, getting rid of the TANKS they have.  WTF does a police department need with a goddamn tank?That was quick. Who would've thought that after Texas and Missouri that it would've been an unpopular idea.Librarians are the last line of defenseThis is a political move that's pretty common, make deeply unpopular threatened cuts, then negotiate to get what you really want, and back off the cuts when you get what you wanted.\n\nIt's stunning that he can find absurd raises for the cops of 40% in some cases but claims a few hundred million for libraries is what's bankrupting the city. 🙄\n\nBut he's a cop, so that makes sense.Ex Cop gets Cops more money while deleting bastions of education. Surprise to no one who googled him even a little.What a shocker, that an ex cop wants to get rid of the one place that would help millions of people stay out of trouble if they can. I'm not even from New York, but I will tell Eric Adams to suck and choke on a razor tipped dildo.I was very surprised when I read the name. I thought [the singer from Manowar](https://en.m.wikipedia.org/wiki/Eric_Adams_(musician)) had become the mayor of New York 😅. He was born there, so it could even make sense!hint: https://www.youtube.com/watch?v=4Zt7bl5Z\\_oAA racist cop tbhYes, all cops.",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "1307hlf",
    "Post Title": "Pirates' Drew Maggi makes major league debut at age 33",
    "Post Body": "",
    "Post Score": 103,
    "Post Upvote Ratio": 0.91,
    "Post Permalink": "/r/UpliftingNews/comments/1307hlf/pirates_drew_maggi_makes_major_league_debut_at/",
    "Post Number Of Comments": 6,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*Don't give up on your dreamsHope he kicked some butt.But they say he has the prostate of a 27 year old so he'll do just fineWithin a century we will see 80 years olds debuting in a major league",
    "HTML Urls:": [],
    "HTML Titles": []
}
{
    "Post ID": "13047sz",
    "Post Title": "After losing beloved dog, grandma gets best surprise from her family– a golden retriever",
    "Post Body": "",
    "Post Score": 92,
    "Post Upvote Ratio": 0.87,
    "Post Permalink": "/r/UpliftingNews/comments/13047sz/after_losing_beloved_dog_grandma_gets_best/",
    "Post Number Of Comments": 7,
    "Comments": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*And in mere moments, a grandmother became a child again. Absolutely heartwarming\n\nಥ_ಥI love this but that is a terrible dog for an elderly person lmao. It would be one thing if it was a few years older and fully trained. But Golden pups are a HANDFUL and I can't imagine that's easy at that age. But sure as fuck better than getting a furry little rat.Thats cute. \n\nBut I am surprised, because some people who loses their beloved pet, don't want to take in another pet, out of fear, that they will leave them too or because they don't want to replace their old pet. But it seems like I am wrong.Hey, I resent that! My furry little rat is a delight. He just hates anyone taller than 5 foot 3 and any non-family animal that exists within sight range!She is an experienced dog owner, and appears to be in good shape. I bet she will be fine.",
    "HTML Urls:": [],
    "HTML Titles": []
}
